app/habac_example/app/controllers/auth_rules_controller.rb

  def index
    @auth_rules = AuthRule.all
---
SELECT "auth_rules".* FROM "auth_rules"

  def create
    @auth_rule = AuthRule.new(auth_rule_params)

    respond_to do |format|
      if @auth_rule.save
---
INSERT INTO "auth_rules" ("ua", "uav", "da", "dav", "oa", "oav", "esa", "esav", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["ua", ""], ["uav", ""], ["da", ""], ["dav", ""], ["oa", ""], ["oav", ""], ["esa", ""], ["esav", ""], ["created_at", "2022-11-21 07:13:20.865540"], ["updated_at", "2022-11-21 07:13:20.865540"]]

  def destroy
    @auth_rule.destroy
---
DELETE FROM "auth_rules" WHERE "auth_rules"."id" = ?  [["id", 1]]

    def set_auth_rule
      @auth_rule = AuthRule.find(params[:id])
---
SELECT "auth_rules".* FROM "auth_rules" WHERE "auth_rules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]