app/habac_example/app/controllers/device_attributes_controller.rb

  def index
    @device_attributes = DeviceAttribute.all
---
SELECT "device_attributes".* FROM "device_attributes"

  def create
    @device_attribute = DeviceAttribute.new(device_attribute_params)

    respond_to do |format|
      if @device_attribute.save
---
INSERT INTO "device_attributes" ("name", "values", "device_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Dangerous Kitchen Appliance"], ["values", "True False"], ["device_id", 3], ["created_at", "2022-11-18 06:15:56.908026"], ["updated_at", "2022-11-18 06:15:56.908026"]]

    def set_device_attribute
      @device_attribute = DeviceAttribute.find(params[:id])
---
SELECT "device_attributes".* FROM "device_attributes" WHERE "device_attributes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]