app/habac_example/app/controllers/devices_controller.rb

  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save
---
INSERT INTO "devices" ("device_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["device_name", "TV"], ["created_at", "2022-11-18 05:16:39.830322"], ["updated_at", "2022-11-18 05:16:39.830322"]]