app/habac_example/app/controllers/environment_state_attributes_controller.rb

  def index
    @environment_state_attributes = EnvironmentStateAttribute.all
---
SELECT "environment_state_attributes".* FROM "environment_state_attributes"

  def create
    @environment_state_attribute = EnvironmentStateAttribute.new(environment_state_attribute_params)

    respond_to do |format|
      if @environment_state_attribute.save
---
INSERT INTO "environment_state_attributes" ("name", "values", "environment_state_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "time"], ["values", ""], ["environment_state_id", 1], ["created_at", "2022-11-21 06:08:28.312449"], ["updated_at", "2022-11-21 06:08:28.312449"]]

    def set_environment_state_attribute
      @environment_state_attribute = EnvironmentStateAttribute.find(params[:id])
---
SELECT "environment_state_attributes".* FROM "environment_state_attributes" WHERE "environment_state_attributes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]