app/habac_example/app/controllers/environment_states_controller.rb

  def index
    @environment_states = EnvironmentState.all
---
SELECT "environment_states".* FROM "environment_states"

  def create
    @environment_state = EnvironmentState.new(environment_state_params)

    respond_to do |format|
      if @environment_state.save
---
INSERT INTO "environment_states" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "current"], ["created_at", "2022-11-21 06:08:15.801502"], ["updated_at", "2022-11-21 06:08:15.801502"]]

    def set_environment_state
      @environment_state = EnvironmentState.find(params[:id])
---
SELECT "environment_states".* FROM "environment_states" WHERE "environment_states"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]