app/habac_example/app/controllers/operation_attributes_controller.rb

SELECT "operation_attributes".* FROM "operation_attributes"
---
  def index
    @operation_attributes = OperationAttribute.all

INSERT INTO "operation_attributes" ("name", "values", "operation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "KidFriendly"], ["values", "true"], ["operation_id", 2], ["created_at", "2022-11-21 06:01:18.184961"], ["updated_at", "2022-11-21 06:01:18.184961"]]
---
  def create
    @operation_attribute = OperationAttribute.new(operation_attribute_params)

    respond_to do |format|
      if @operation_attribute.save

SELECT "operation_attributes".* FROM "operation_attributes" WHERE "operation_attributes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_operation_attribute
      @operation_attribute = OperationAttribute.find(params[:id])