app/habac_example/app/controllers/operations_controller.rb

  def index
    @operations = Operation.all
---
SELECT "operations".* FROM "operations"

  def create
    @operation = Operation.new(operation_params)

    respond_to do |format|
      if @operation.save
---
INSERT INTO "operations" ("name", "device_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "G"], ["device_id", 1], ["created_at", "2022-11-21 05:56:17.946795"], ["updated_at", "2022-11-21 05:56:17.946795"]]

  def destroy
    @operation.destroy
---
DELETE FROM "operations" WHERE "operations"."id" = ?  [["id", 1]]

    def set_operation
      @operation = Operation.find(params[:id])
---
SELECT "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]