app/habac_example/app/controllers/pages_controller.rb

  def index
    EnvironmentStateAttribute.find_by(name: "parent_in_kitchen").update(values: ["true", "false"].sample)
---
SELECT "environment_state_attributes".* FROM "environment_state_attributes" WHERE "environment_state_attributes"."name" = ? LIMIT ?  [["name", "parent_in_kitchen"], ["LIMIT", 1]]
UPDATE "environment_state_attributes" SET "values" = ?, "updated_at" = ? WHERE "environment_state_attributes"."id" = ?  [["values", "true"], ["updated_at", "2022-11-21 10:04:16.859658"], ["id", 2]]