app/habac_example/app/controllers/user_attributes_controller.rb

SELECT "user_attributes".* FROM "user_attributes"
---
  def index
    @user_attributes = UserAttribute.all

INSERT INTO "user_attributes" ("user_id", "name", "values", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "relationship"], ["values", "parent"], ["created_at", "2022-11-21 05:52:00.816141"], ["updated_at", "2022-11-21 05:52:00.816141"]]
---
  def create
    @user_attribute = UserAttribute.new(user_attribute_params)

    respond_to do |format|
      if @user_attribute.save

SELECT "user_attributes".* FROM "user_attributes" WHERE "user_attributes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user_attribute
      @user_attribute = UserAttribute.find(params[:id])