app/habac_example/app/views/operations/_form.html.erb

SELECT "devices".* FROM "devices"
---
    <%= form.label :device_id, style: "display: block" %>
    <%= form.select :device_id, options_for_select(Device.all.map{|s|[s.name, s.id]}) %>