app/habac_example/app/views/environment_state_attributes/_form.html.erb

SELECT "environment_states".* FROM "environment_states"
---
    <%= form.label :environment_state_id, style: "display: block" %>
    <%= form.select :environment_state_id,  options_for_select(EnvironmentState.all.map{|s|[s.name, s.id]}) %>