app/habac_example/app/views/operation_attributes/_form.html.erb

SELECT "operations".* FROM "operations"
---
    <%= form.label :operation_id, style: "display: block" %>
    <%= form.select :operation_id, options_for_select(Operation.all.map{|s|[s.name, s.id]}) %>