app/habac_example/app/models/auth_rule.rb

SELECT "environment_state_attributes".* FROM "environment_state_attributes" WHERE "environment_state_attributes"."name" = ? LIMIT ?  [["name", "parent_in_kitchen"], ["LIMIT", 1]]
---
  def self.get_env(k)
    k.downcase!
    if k == "time"
      return Time.now.hour.to_s
    end
    if k == "day"
      return Time.now.wday.to_s
    end
    if k == "parent_in_kitchen"
      return EnvironmentStateAttribute.find_by(name: "parent_in_kitchen").values

SELECT "auth_rules".* FROM "auth_rules"
---
  def self.check(k,v)
    return false if !k.present? && v.present?

SELECT "operations".* FROM "operations"
---
  def self.allowed_ops(user)
    Operation.select { |op| AuthRule.check_op(user, op)}

SELECT "auth_rules".* FROM "auth_rules"
SELECT "device_attributes".* FROM "device_attributes" WHERE "device_attributes"."device_id" = ? AND "device_attributes"."name" = ? LIMIT ?  [["device_id", 1], ["name", "DangerousKitchenDevice"], ["LIMIT", 1]]
SELECT "operation_attributes".* FROM "operation_attributes" WHERE "operation_attributes"."operation_id" = ? AND "operation_attributes"."name" = ? LIMIT ?  [["operation_id", 2], ["name", "KidFriendly"], ["LIMIT", 1]]
SELECT "user_attributes".* FROM "user_attributes" WHERE "user_attributes"."user_id" = ? AND "user_attributes"."name" = ? LIMIT ?  [["user_id", 1], ["name", "relationship"], ["LIMIT", 1]]
---
  def self.check_op(user, req_op)
    AuthRule.all.each do |auth_rule|
      next unless auth_rule.da.present? || auth_rule.ua.present? || auth_rule.oa.present? || auth_rule.esa.present?
      allowed = true

      # Check device attr constraints
      if auth_rule.da.present?
        k = req_op.device.device_attributes.find_by(name: auth_rule.da)&.values
        v = auth_rule.dav
        allowed = allowed && check(k,v)
      end

      # Check op attr constraints
      if auth_rule.oa.present?
        k = req_op.operation_attributes.find_by(name: auth_rule.oa)&.values
        v = auth_rule.oav
        allowed = allowed && check(k,v)
      end

      # Check device attr constraints
      if auth_rule.ua.present?
        k = user.user_attributes.find_by(name: auth_rule.ua)&.values