app/habac_example/app/views/user_attributes/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id, style: "display: block" %>
    <%= form.select :user_id,  options_for_select(User.all.map{|s|[s.email, s.id]}) %>