app/habac_example/app/views/pages/index.html.erb

SELECT "environment_state_attributes".* FROM "environment_state_attributes" WHERE "environment_state_attributes"."name" = ? LIMIT ?  [["name", "parent_in_kitchen"], ["LIMIT", 1]]
---
                </div>
                <div class="h5 mb-0 font-weight-bold text-gray-800"><%= EnvironmentStateAttribute.find_by_name("parent_in_kitchen").values == "true" ? "Yes" : "No" %></div>