app/habac_example/app/views/auth_rules/_form.html.erb

    <%= form.label :ua, "User Attribute", style: "display: block" %>
    <%= form.select :ua, options_for_select(UserAttribute.pluck(:name).uniq<< nil ) %>
---
SELECT "user_attributes"."name" FROM "user_attributes"

    <%= form.label :uav, style: "display: block" %>
    <%= form.select :uav, options_for_select(UserAttribute.pluck(:values).uniq << nil ) %>
---
SELECT "user_attributes"."values" FROM "user_attributes"

    <%= form.label :da, style: "display: block" %>
    <%= form.select :da, options_for_select(DeviceAttribute.pluck(:name).uniq<< nil ) %>
---
SELECT "user_attributes"."name" FROM "user_attributes"
SELECT "device_attributes"."name" FROM "device_attributes"

    <%= form.label :dav, style: "display: block" %>
    <%= form.select :dav, options_for_select(DeviceAttribute.pluck(:values).uniq << nil ) %>
---
SELECT "user_attributes"."values" FROM "user_attributes"
SELECT "device_attributes"."values" FROM "device_attributes"

    <%= form.label :oa, style: "display: block" %>
    <%= form.select :oa, options_for_select(OperationAttribute.pluck(:name).uniq<< nil ) %>
---
SELECT "operation_attributes"."name" FROM "operation_attributes"

    <%= form.label :oav, style: "display: block" %>
    <%= form.select :oav, options_for_select(OperationAttribute.pluck(:values).uniq << nil ) %>
---
SELECT "operation_attributes"."values" FROM "operation_attributes"

    <%= form.label :esa, style: "display: block" %>
    <%= form.select :esa, options_for_select(EnvironmentStateAttribute.pluck(:name).uniq << nil) %>
---
SELECT "environment_state_attributes"."name" FROM "environment_state_attributes"